In [127]:
# Import pandas package  
import pandas as pd 
  
# Define a dictionary containing Students data 
data = {'Name': ['Venkata', 'Sai', 'Ram', 'Reddy'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['MCA', 'Mtech', 'Msc', 'Msc']} 
  
# Convert the dictionary into DataFrame 
address_df = pd.DataFrame(data) 
address_df

      Name  Height Qualification
0  Venkata     5.1           MCA
1      Sai     6.2         Mtech
2      Ram     5.1           Msc
3    Reddy     5.2           Msc

# creating a new column in the exsiting Dataset

In [128]:
Address =['Mumbai','Pune','Hyderabad','Vijayawada']
address_df['Address'] = Address

In [129]:
address_df

      Name  Height Qualification     Address
0  Venkata     5.1           MCA      Mumbai
1      Sai     6.2         Mtech        Pune
2      Ram     5.1           Msc   Hyderabad
3    Reddy     5.2           Msc  Vijayawada

In [130]:
#By using DataFrame.insert()
a = address_df.insert(2, 'Age',[40,26,22,28])

In [131]:
address_df

      Name  Height  Age Qualification     Address
0  Venkata     5.1   40           MCA      Mumbai
1      Sai     6.2   26         Mtech        Pune
2      Ram     5.1   22           Msc   Hyderabad
3    Reddy     5.2   28           Msc  Vijayawada

In [132]:
#Using Dataframe.assign() method
address_df.assign(Pincode =[400004,411028,5000001,520004])

      Name  Height  Age Qualification     Address  Pincode
0  Venkata     5.1   40           MCA      Mumbai   400004
1      Sai     6.2   26         Mtech        Pune   411028
2      Ram     5.1   22           Msc   Hyderabad  5000001
3    Reddy     5.2   28           Msc  Vijayawada   520004

In [133]:
address_df

      Name  Height  Age Qualification     Address
0  Venkata     5.1   40           MCA      Mumbai
1      Sai     6.2   26         Mtech        Pune
2      Ram     5.1   22           Msc   Hyderabad
3    Reddy     5.2   28           Msc  Vijayawada

In [134]:
#Using Dataframe.assign() method
address_df.assign(Pincode =[400004,411028,5000001,520004])

      Name  Height  Age Qualification     Address  Pincode
0  Venkata     5.1   40           MCA      Mumbai   400004
1      Sai     6.2   26         Mtech        Pune   411028
2      Ram     5.1   22           Msc   Hyderabad  5000001
3    Reddy     5.2   28           Msc  Vijayawada   520004

In [135]:
address_df

      Name  Height  Age Qualification     Address
0  Venkata     5.1   40           MCA      Mumbai
1      Sai     6.2   26         Mtech        Pune
2      Ram     5.1   22           Msc   Hyderabad
3    Reddy     5.2   28           Msc  Vijayawada

# How will retrieve a single column from pandas dataframe

In [136]:
address_df['Name']

0    Venkata
1        Sai
2        Ram
3      Reddy
Name: Name, dtype: object

# How will add the value of two columns in padas dataframe to create a new column

In [137]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.rand(3,3), columns = ['AAA','BBB','CCC'])

In [138]:
df

        AAA       BBB       CCC
0  0.255557  0.895298  0.604156
1  0.644489  0.359643  0.332436
2  0.939998  0.053617  0.710011

In [139]:
df['DDD'] = df['BBB']+df['CCC']

In [140]:
df

        AAA       BBB       CCC       DDD
0  0.255557  0.895298  0.604156  1.499454
1  0.644489  0.359643  0.332436  0.692080
2  0.939998  0.053617  0.710011  0.763628

# How will you delete a column in pandas data frame?

In [141]:
df.drop(columns='DDD',axis =1)

        AAA       BBB       CCC
0  0.255557  0.895298  0.604156
1  0.644489  0.359643  0.332436
2  0.939998  0.053617  0.710011

# How can we select a column in Pandas data frame

In [142]:
#Select single column in the data frame
df.loc[:,['AAA']]

        AAA
0  0.255557
1  0.644489
2  0.939998

In [143]:
#select multiple columns in the pandas data set

df.loc[:,['AAA','BBB']]

        AAA       BBB
0  0.255557  0.895298
1  0.644489  0.359643
2  0.939998  0.053617

# How can we retrieve a row in pandas

In [144]:
df

        AAA       BBB       CCC       DDD
0  0.255557  0.895298  0.604156  1.499454
1  0.644489  0.359643  0.332436  0.692080
2  0.939998  0.053617  0.710011  0.763628

In [145]:
df.loc[:0]

        AAA       BBB       CCC       DDD
0  0.255557  0.895298  0.604156  1.499454

# How will you slice rows in pandas dataset

In [146]:
df.loc[1:2]

        AAA       BBB       CCC       DDD
1  0.644489  0.359643  0.332436  0.692080
2  0.939998  0.053617  0.710011  0.763628

# How will you append new rows to pandas data set

In [147]:
adding_first_row_first_column = df.loc[:0,'AAA'] +df.loc[:0,'BBB']
adding_first_row_second_column = df.loc[:1,'AAA'] +df.loc[:1,'BBB']
adding_first_row_third_column = df.loc[:0,'CCC'] +df.loc[:0,'DDD']
adding_first_row_fourth_column = df.loc[:1,'CCC'] +df.loc[:1,'DDD']


df1 = pd.DataFrame({'AAA':[adding_first_row_first_column],
                    'BBB':[adding_first_row_second_column],
                    'CCC':[adding_first_row_third_column],
                    'DDD':[adding_first_row_fourth_column]
                   },columns =['AAA','BBB','CCC','DDD']
                )
new_df = df.append(df1,ignore_index =True)
new_df

,AAA,BBB,CCC,DDD
0,0.255557,0.895298,0.604156,1.49945
1,0.644489,0.359643,0.332436,0.69208
2,0.939998,0.0536172,0.710011,0.763628
3,0 1.150855 dtype: float64,0 1.150855 1 1.004132 dtype: float64,0 2.10361 dtype: float64,0 2.103610 1 1.024516 dtype: float64

# Rounding the number after decimal

In [148]:
df

        AAA       BBB       CCC       DDD
0  0.255557  0.895298  0.604156  1.499454
1  0.644489  0.359643  0.332436  0.692080
2  0.939998  0.053617  0.710011  0.763628

In [149]:
df.round(3)

     AAA    BBB    CCC    DDD
0  0.256  0.895  0.604  1.499
1  0.644  0.360  0.332  0.692
2  0.940  0.054  0.710  0.764

# how will you delete a row in pandas data frame

In [150]:
new_df

,AAA,BBB,CCC,DDD
0,0.255557,0.895298,0.604156,1.49945
1,0.644489,0.359643,0.332436,0.69208
2,0.939998,0.0536172,0.710011,0.763628
3,0 1.150855 dtype: float64,0 1.150855 1 1.004132 dtype: float64,0 2.10361 dtype: float64,0 2.103610 1 1.024516 dtype: float64

In [151]:
new_df.drop(3,axis=0,inplace=True)

In [152]:
new_df

        AAA        BBB       CCC       DDD
0  0.255557   0.895298  0.604156   1.49945
1  0.644489   0.359643  0.332436   0.69208
2  0.939998  0.0536172  0.710011  0.763628

# How will you get the number of rows and columns of Data Frame in pandas

In [153]:
address_df

      Name  Height  Age Qualification     Address
0  Venkata     5.1   40           MCA      Mumbai
1      Sai     6.2   26         Mtech        Pune
2      Ram     5.1   22           Msc   Hyderabad
3    Reddy     5.2   28           Msc  Vijayawada

In [154]:
address_df.iloc[1:3,0:3]

  Name  Height  Age
1  Sai     6.2   26
2  Ram     5.1   22

# How will you get top two rows in Padas data

In [155]:
address_df.head(2)

      Name  Height  Age Qualification Address
0  Venkata     5.1   40           MCA  Mumbai
1      Sai     6.2   26         Mtech    Pune

# How will you get last two rows in Padas data

In [156]:
address_df.tail(2)

    Name  Height  Age Qualification     Address
2    Ram     5.1   22           Msc   Hyderabad
3  Reddy     5.2   28           Msc  Vijayawada

# How will you get the number of elements in the Data frame in panda

In [157]:
# importing pandas as pd 
import pandas as pd 
  
# Creating a dataframe using dictionary 
df = pd.DataFrame({"AAA":[15, 88, 12,15, None, -13],  
                   "BBB":[-1, None, 6, None,4, 3], 
                   "CCC":["Venkata", "Sai", np.nan,"Charan", np.nan, "Ram"]}) 
  
# Printing the dataframe 
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

In [158]:
df.count(axis =0)

AAA    5
BBB    4
CCC    4
dtype: int64

In [159]:
df.count(axis =1)

0    3
1    2
2    2
3    2
4    1
5    3
dtype: int64

# How will you get the names

In [160]:
df.columns

Index(['AAA', 'BBB', 'CCC'], dtype='object')

# How will you convert data frame in to array in panads

In [161]:
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

In [162]:
df.to_numpy

<bound method DataFrame.to_numpy of     AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram>

# How can you check if a dataframe is empty in pandas

In [163]:
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

In [164]:
df.empty

False

# How can you get the sum of values in the column in pandas data frame

In [165]:
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

In [166]:
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

In [167]:
df.sum(axis=0,skipna = True)

AAA    117.0
BBB     12.0
dtype: float64

In [168]:
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

# How will you get the average of values of a column in a pandas data fra

In [169]:
df

    AAA  BBB      CCC
0  15.0 -1.0  Venkata
1  88.0  NaN      Sai
2  12.0  6.0      NaN
3  15.0  NaN   Charan
4   NaN  4.0      NaN
5 -13.0  3.0      Ram

In [170]:
df.mean(axis=0, skipna=True)

AAA    23.4
BBB     3.0
dtype: float64

# How will you get the statistical summary of the data frame in pandas

In [171]:
df.describe()

             AAA      BBB
count   5.000000  4.00000
mean   23.400000  3.00000
std    37.977625  2.94392
min   -13.000000 -1.00000
25%    12.000000  2.00000
50%    15.000000  3.50000
75%    15.000000  4.50000
max    88.000000  6.00000

# How will you apply a funciton to every data element in a DataFrame

In [172]:
# List of Tuples
matrix = [(111, 11, 1),
         (2, 22, 222),
         (333, 33, 3),
         (444, 333, 222),
         (222, 333, 444),
         (777, 666, 555)
         ]

data_matrix = pd.DataFrame(matrix,columns = list('abc'))

data_matrix

     a    b    c
0  111   11    1
1    2   22  222
2  333   33    3
3  444  333  222
4  222  333  444
5  777  666  555

In [173]:
apply_matrix=data_matrix.apply(lambda row_col:row_col+10)
print(apply_matrix)

     a    b    c
0  121   21   11
1   12   32  232
2  343   43   13
3  454  343  232
4  232  343  454
5  787  676  565

# How will apply a function to a row of pandas data frame

In [174]:
df['Add_col_sumofRows'] = apply_matrix.apply(np.sum,axis=1 )

In [175]:
df

    AAA  BBB      CCC  Add_col_sumofRows
0  15.0 -1.0  Venkata                153
1  88.0  NaN      Sai                276
2  12.0  6.0      NaN                399
3  15.0  NaN   Charan               1029
4   NaN  4.0      NaN               1029
5 -13.0  3.0      Ram               2028

In [176]:
# sum over the column axis. 
df.sum(axis = 1, skipna = True)

0     167.0
1     364.0
2     417.0
3    1044.0
4    1033.0
5    2018.0
dtype: float64

# What is reindexing in pandas?

In [177]:
df

    AAA  BBB      CCC  Add_col_sumofRows
0  15.0 -1.0  Venkata                153
1  88.0  NaN      Sai                276
2  12.0  6.0      NaN                399
3  15.0  NaN   Charan               1029
4   NaN  4.0      NaN               1029
5 -13.0  3.0      Ram               2028

In [178]:
df.reindex(index=['A','B','C','D','E','F'])

   AAA  BBB  CCC  Add_col_sumofRows
A  NaN  NaN  NaN                NaN
B  NaN  NaN  NaN                NaN
C  NaN  NaN  NaN                NaN
D  NaN  NaN  NaN                NaN
E  NaN  NaN  NaN                NaN
F  NaN  NaN  NaN                NaN

# How will you rename a column in pandas DataFrame?

In [179]:
df.rename(columns = {'AAA':'aaa'}, inplace = True)

In [180]:
df

    aaa  BBB      CCC  Add_col_sumofRows
0  15.0 -1.0  Venkata                153
1  88.0  NaN      Sai                276
2  12.0  6.0      NaN                399
3  15.0  NaN   Charan               1029
4   NaN  4.0      NaN               1029
5 -13.0  3.0      Ram               2028

# How will you iterate all the items in the data frame in pandas

In [181]:
df

    aaa  BBB      CCC  Add_col_sumofRows
0  15.0 -1.0  Venkata                153
1  88.0  NaN      Sai                276
2  12.0  6.0      NaN                399
3  15.0  NaN   Charan               1029
4   NaN  4.0      NaN               1029
5 -13.0  3.0      Ram               2028

In [182]:
for row,col in df.iterrows():
    print(row, col)
    print()

0 aaa                       15
BBB                       -1
CCC                  Venkata
Add_col_sumofRows        153
Name: 0, dtype: object

1 aaa                   88
BBB                  NaN
CCC                  Sai
Add_col_sumofRows    276
Name: 1, dtype: object

2 aaa                   12
BBB                    6
CCC                  NaN
Add_col_sumofRows    399
Name: 2, dtype: object

3 aaa                      15
BBB                     NaN
CCC                  Charan
Add_col_sumofRows      1029
Name: 3, dtype: object

4 aaa                   NaN
BBB                     4
CCC                   NaN
Add_col_sumofRows    1029
Name: 4, dtype: object

5 aaa                   -13
BBB                     3
CCC                   Ram
Add_col_sumofRows    2028
Name: 5, dtype: object

In [183]:
df

    aaa  BBB      CCC  Add_col_sumofRows
0  15.0 -1.0  Venkata                153
1  88.0  NaN      Sai                276
2  12.0  6.0      NaN                399
3  15.0  NaN   Charan               1029
4   NaN  4.0      NaN               1029
5 -13.0  3.0      Ram               2028

In [184]:
for key,value in df.iteritems():
    print(key, value)
    print()

aaa 0    15.0
1    88.0
2    12.0
3    15.0
4     NaN
5   -13.0
Name: aaa, dtype: float64

BBB 0   -1.0
1    NaN
2    6.0
3    NaN
4    4.0
5    3.0
Name: BBB, dtype: float64

CCC 0    Venkata
1        Sai
2        NaN
3     Charan
4        NaN
5        Ram
Name: CCC, dtype: object

Add_col_sumofRows 0     153
1     276
2     399
3    1029
4    1029
5    2028
Name: Add_col_sumofRows, dtype: int64

In [185]:
for i in df.itertuples():
    print(i)
    print()

Pandas(Index=0, aaa=15.0, BBB=-1.0, CCC='Venkata', Add_col_sumofRows=153)

Pandas(Index=1, aaa=88.0, BBB=nan, CCC='Sai', Add_col_sumofRows=276)

Pandas(Index=2, aaa=12.0, BBB=6.0, CCC=nan, Add_col_sumofRows=399)

Pandas(Index=3, aaa=15.0, BBB=nan, CCC='Charan', Add_col_sumofRows=1029)

Pandas(Index=4, aaa=nan, BBB=4.0, CCC=nan, Add_col_sumofRows=1029)

Pandas(Index=5, aaa=-13.0, BBB=3.0, CCC='Ram', Add_col_sumofRows=2028)

# Can we modify the data in dataframe while iterarating over it?

In [238]:
# Do not try to modify any object while iterating. 
#$Iterating is meant for reading and the iterator returns a copy of the original object (a view), 
#thus the changes will not reflect on the original object.
import pandas as pd
import numpy as np
dfq = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])

for index, row in dfq.iterrows():
   row[0] = 10
print(dfq)

   col1      col2      col3
0  10.0  1.021980 -0.782637
1  10.0 -0.531880 -1.586606
2  10.0  2.030461  0.994698
3  10.0 -2.657939  0.775149

# select the rows where the students' favorite color is blue or yellow and their grade is above 90 in  Pandas .

In [233]:
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
                'age': [20, 19, 22, 21],
                'favorite_color': ['blue', 'blue', 'yellow', "green"],
                'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

In [207]:
#define array of target colors
favorite_color_filter = ['blue', 'yellow']
#To select rows whose column value is in an iterable array, which we defined as fav_color_filter, we can use isin
df = df.loc[df['favorite_color'].isin(favorite_color_filter)]
#next, we need to filter on scores above 90. here we can use loc on our dataframe:
df = df.loc[(df['grade'] >= 90)]
df

           name  age favorite_color  grade
1   Al Jennings   19           blue     92
2  Omar Mullins   22         yellow     95

In [ ]:
df = df.loc[df['favorite_color'].isin(favorite_color_filter)]

In [ ]:
#https://www.amazon.in/Top-Pandas-Interview-Questions-Answers-ebook/dp/B07H86RV5Q

In [ ]:
#https://s3.amazonaws.com/assets.datacamp.com/production/course_2566/slides/ch4_slides.pdf